{
	"work": {
		"location": "oracle-redwood",
    "logo": "/static/work/oracle-redwood/logo.svg",
    "description": "Oracle Redwood Design System",
    "preview": "/static/work/oracle-redwood/preview.jpg",
    "background":"/static/work/oracle-redwood/background.jpg",
    "color": "#312D2A",
    "text": "white",
		"url": "https://design.oracle.com"
	},
	"components": [
    {
  		"name": "TextContent",
  		"props": {
  			"content": "<p>Oracle has some great products and applications, but most of them did not look like they were made by the same company. In the spirit of creating consistency, we analyzed all of our user interfaces, looked for patterns and common components, and, at the end developed a massive design system called <b>Redwood.</b> But this process, as most projects in large companies, was not straight forward and it took massive cross-team collaboration and support from Oracle's leadership team, including <b>Larry Ellison</b> himself.</p>"
  		}
	 },
	 {
		 "name": "TextContent",
		 "props": {
			 "content": "<p>We flew to Seattle, where we gathered in a room for a week to explore ideas of how this system should look, function, and sound. At the end of that week, we narrowed down to three very distinct design directions that we would be equally proud to develop as a design system.The idea was to present the design directions to our executives and customers and come up with the winning one. </p>"
		 }
	},
   {
     "name": "Youtube",
     "props": {
       "url": "https://www.youtube-nocookie.com/embed/fc6tCZlEOVo",
       "caption": "Oracle Redwood Design System sneak peek"
     }
   },
   {
     "name": "TextContent",
     "props": {
       "content": "<p>It was fun developing Oracle’s first design wireframe toolkit during this project. Before we even knew how the design system components would look visually, designers could create mockups for applications and get feedback for their early designs.</p><p>Once the visual design was created, designers could convert their wireframes into high definition composition with a click of a button.</p>"
     }
  	},
    {
      "name": "Youtube",
      "props": {
        "url": "https://www.youtube-nocookie.com/embed/lY6EBo51Mks",
        "caption": "OneDesign Wireframe Toolkit"
      }
    },
		{
			"name": "TextContent",
			"props": {
				"content": "<p>We showcased a sneak peek video of Redwood at our <a href='https://design.oracle.com' target='_blank'>design.oracle.com</a> website. It was also a good opportunity to talk a little bit about our design team, culture at Oracle, and to list our career opportunities.</p>"
			}
	 },
	 {
		 "name": "Images",
		 "props": {
			 "url": "/static/work/oracle-redwood/design-oracle.jpg",
			 "alt": "Oracle.com workshop"
		 }
	 },
	 {
		 "name": "TextContent",
		 "props": {
			 "content": "<p>Redwood was officially revealed to the public during OpenWorld 19. This is the official video of the keynote by Steve Miranda and Hillel Cooperman.</p>"
		 }
	},
	{
		"name": "Youtube",
		"props": {
			"url": "https://www.youtube.com/embed/3TW2y35asTM",
			"caption": "Redwood reveal during OpenWorld 19"
		}
	}
	]
}
